Examinator/src/InformationRegisters/ОтложенныеЗаданияНаПроверкуСУО/ОтложенныеЗаданияНаПроверкуСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтложенныеЗаданияНаПроверкуСУО</name>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПопыткаВыполнения</name>
    <type>
      <types>DocumentRef.ПопыткаВыполненияЗаданияСУО</types>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
      <types>DocumentRef.ПопыткаВыполненияПодборкиВопросовСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ОтложенныеЗаданияНаПроверкуСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ОтложитьЗадание(Знач ПопыткаВыполнения, Знач Преподаватель, Знач ПрохождениеОбучения) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОтложенныеЗаданияНаПроверкуСУО");
		ЭлементБлокировки.УстановитьЗначение("ПопыткаВыполнения", ПопыткаВыполнения);	
		ЭлементБлокировки.УстановитьЗначение("Преподаватель", Преподаватель);	
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
		
		
		МенеджерЗаписи = РегистрыСведений.ОтложенныеЗаданияНаПроверкуСУО.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ПопыткаВыполнения = ПопыткаВыполнения;
		МенеджерЗаписи.Преподаватель = Преподаватель;		
		МенеджерЗаписи.ПрохождениеОбучения = ПрохождениеОбучения;	
		МенеджерЗаписи.ДатаИзменения = ТекущаяДатаСеанса();
		
		МенеджерЗаписи.Записать(Истина);			
		
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
